; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	spectrograph0 - mode
	spectrograph1 - mode
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 spectrograph1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 spectrograph0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument6 spectrograph1)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
)
(:goal (and
	(pointing satellite1 GroundStation4)
	(have_image Star5 spectrograph1)
	(have_image Planet6 spectrograph0)
	(have_image Planet7 spectrograph1)
	(have_image Star8 spectrograph1)
	(have_image Phenomenon9 spectrograph1)
	(have_image Star10 spectrograph1)
	(have_image Star11 spectrograph0)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
2. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 8
3. (turn_to satellite1 star10 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star10)
   goals met: 0 of 8
4. (take_image satellite1 star10 instrument3 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 1 of 8
5. (turn_to satellite1 planet7 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet7)
   goals met: 1 of 8
6. (take_image satellite1 planet7 instrument3 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 2 of 8
7. (turn_to satellite1 planet6 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet6)
   goals met: 2 of 8
8. (take_image satellite1 planet6 instrument3 spectrograph0)
   added: (have_image planet6 spectrograph0)
   goals met: 3 of 8
9. (turn_to satellite1 phenomenon9 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 8
10. (take_image satellite1 phenomenon9 instrument3 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 4 of 8
11. (turn_to satellite1 star11 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star11)
   goals met: 4 of 8
12. (take_image satellite1 star11 instrument3 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 5 of 8
13. (turn_to satellite1 star5 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star5)
   goals met: 5 of 8
14. (take_image satellite1 star5 instrument3 spectrograph1)
   added: (have_image star5 spectrograph1)
   goals met: 6 of 8
15. (turn_to satellite1 star8 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star8)
   goals met: 6 of 8
16. (take_image satellite1 star8 instrument3 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 7 of 8
17. (turn_to satellite1 groundstation4 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation4)
   goals met: 8 of 8
